/*总体思路：先满月，再满年*/ 
#include"stdio.h"
int main()
{ 
	int y=0,y2=0,m=0,m2=0,d=0,d2=0,N,a;
	scanf("%d%d%d%d",&y,&m,&d,&N);
	if(m==1||m==3||m==5||m==7||m==8||m==10||m==12) a=31-d;//a为该月剩余天数 
	else if(m==4||m==6||m==9||m==11) a=30-d;
	else 
	{
		if(y%4==0&&y%100!=0||y%400==0) a=29-d;
		else a=28-d; 
	}
	if(N<=a) printf("%d.%d.%d\n",y,m,d+N);//天数小于本月剩余天数，则直接输出差即可 
	else
	{
		N=N-a;//大于剩余天数则月份加一 
		m++;
		while(N>0) //逐个月向后推，超过一个月的天数则月份加一，超过一个年的月数则年份加一 
		{
		  	if(m==1||m==3||m==5||m==7||m==8||m==10||m==12)
			{
				N=N-31;
			   	m++;
			}
			else if(m==4||m==6||m==9||m==11) 
			{
			   N=N-30;
			   m++;
			}
			else if(m==2)
			{
			   	if((y%4==0&&y%100!=0)||y%400==0)
			   	{
			    	N=N-29;
					m++;
			   	}
				else
			   	{
				    N=N-28;
				    m++;
			   	}
			}
			else if(m==13) //考虑到月份是12，再相加则年份加一 
			{
			   	y++;
			   	N=N-31;
			   	m=2;
			}
		}
		m--;//由于条件设置为N>0；所以得到的N为负，所以月份减一！！！ 
		if(m==1||m==3||m==5||m==7||m==8||m==10||m==12) printf("%d.%d.%d\n",y,m,N+31);
	  	else if(m==4||m==6||m==9||m==11)  printf("%d.%d.%d\n",y,m,N+30);
	 	else if(m==2)
	 	{
	 		if((y%4==0&&y%100!=0)||y%400==0) printf("%d.%d.%d\n",y,m,N+29); 
			else  printf("%d.%d.%d\n",y,m,N+28);
	   	}
	}
	return 0;
}
