#include"stdio.h"
#define N 200
int main()
{
	int a[N][2];   
	int C=0,L,M,t1,t2,i,j,x1,x2,flag=0;
	scanf("%d%d",&L,&M);
	for(i=0;i<M;i++)  
		for(j=0;j<2;j++)  
			scanf("%d",&a[i][j]);
	for(i=0;i<M-1;i++)   //对各个区间进行排序，以区间左端数值大小为标准 
	{
		for(j=0;j<M-1;j++)
		{
			if(a[j][0]>a[j+1][0]) 
			{
				t1=a[j][0];        t2=a[j][1];
				a[j][0]=a[j+1][0]; a[j][1]=a[j+1][1];
				a[j+1][0]=t1;      a[j+1][1]=t2;
			}
		}
	}
//	printf("****************************************\n");
//	for(i=0;i<M;i++)  
//			printf("%d %d\n",a[i][0],a[i][1]);//printf("\n");
	x1=a[0][0];x2=a[0][1];  //以第一个区间为基准(x1,x2)，讨论下一个区间 
	for(i=1;i<=M-1;i++)      //(1).两个区间有交集(交叉或者包含),则基准区间变成两区间的并集 
	{                       //(2).两个区间无交集,则算出第一个区间长度,并以第二个区间为基准 
		if(x2>=a[i][0]) 
		{
			if(x2>=a[i][1])  x2=x2;//可以改一下if的条件 
			else x2=a[i][1];
		}
		else
		{
			flag++;
			C=C+x2-x1+1;
			x1=a[i][0];x2=a[i][1];
			if(i==M-1) C+=a[M-1][1]-a[M-1][0]+1;//特殊情况：加到倒数第二个出现断开，还要把最后那个区间加起来 
		}
	}
	if(flag>0) printf("%d",L+1-C); 
	else printf("%d",L-x2+x1);//要考虑没有断开的情况 ！！！ 
	return 0;
}
